Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
#include <Arduino.h>
#include <ESP32Servo.h>
#include <Preferences.h>
#include <stdarg.h>
#include <stdio.h>
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

namespace {

constexpr int SERVO_PIN = 18;
constexpr int SENSOR_PIN = 15;
constexpr int SENSOR_HYSTERESIS = 8;

constexpr size_t CLICK_QUEUE_SIZE = 12;
constexpr size_t LOG_QUEUE_SIZE = 16;
constexpr size_t WIDTH_HISTORY_SIZE = 15;
constexpr size_t CLASSIFY_WARMUP = 4;

constexpr float DEFAULT_SENSOR_RATIO = 2.0f;

// Chromium / Chromium-derived runner defaults.
constexpr uint32_t DEFAULT_GAME_FPS = 60;
constexpr uint32_t MIN_GAME_FPS = 30;
constexpr uint32_t MAX_GAME_FPS = 360;
constexpr uint32_t DEFAULT_FIRST_CACTUS_DELAY_MS = 3000;
constexpr uint32_t MAX_FIRST_CACTUS_DELAY_MS = 10000;
constexpr float GAME_START_SPEED = 6.0f;
constexpr float GAME_MAX_SPEED = 13.0f;
constexpr float GAME_ACCEL_PER_FRAME = 0.001f;
constexpr uint32_t GAME_MAX_ACCEL_FRAMES = 7000;

constexpr uint32_t CONFIG_MAGIC = 0xD1A02026;
constexpr uint16_t CONFIG_VERSION = 3;

enum class ThemeMode : uint8_t { Auto, Light, Dark };

// Exact firmware-v1/v2 layout.
struct LegacyConfig {
  uint32_t magic;
  uint16_t version;
  int threshold;
  int restAngle;
  int pressAngle;
  uint32_t holdMs;
  uint32_t actuatorMs;
  uint32_t travelMs;
  uint32_t minTravelMs;
  uint32_t airMs;
  uint32_t landingMs;
  uint32_t clearanceMs;
  uint32_t gapMs;
  uint32_t cooldownMs;
  uint32_t rearmMs;
  uint32_t themeFlipMs;
  uint32_t sampleMs;
  bool adapt;
  float adaptStepPct;
  ThemeMode theme;
  bool debug;
};

// Keep firmware-v3 layout unchanged so current NVS calibration survives.
struct Config {
  uint32_t magic = CONFIG_MAGIC;
  uint16_t version = CONFIG_VERSION;
  int threshold = 200;
  int restAngle = 35;
  int pressAngle = 38;
  uint32_t holdMs = 80;
  uint32_t airMs = 450;
  uint32_t longHoldMs = 160;
  uint32_t longAirMs = 520;
  float longAtWidths = 1.60f;
  uint32_t actuatorMs = 160;
  uint32_t travelMs = 1550;
  uint32_t minTravelMs = 350;
  uint32_t landingMs = 50;
  uint32_t clearanceMs = 100;
  uint32_t gapMs = 40;
  uint32_t cooldownMs = 70;
  uint32_t rearmMs = 12;
  uint32_t themeFlipMs = 1500;
  uint32_t sampleMs = 5;
  bool adapt = true;
  float adaptStepPct = 3.0f;  // NVS compatibility only.
  ThemeMode theme = ThemeMode::Auto;
  bool debug = false;
};

struct ClickCommand {
  uint64_t atMs;
  uint32_t generation;
  int pressAngle;
  int restAngle;
  uint32_t holdMs;
  bool manual;
  bool debug;
};

struct Detector {
  bool active = false;
  uint64_t startMs = 0;
  uint64_t lastObstacleMs = 0;
  uint64_t oppositeSinceMs = 0;
  uint64_t lastLandingMs = 0;
  uint64_t lastCommandMs = 0;
  bool hasPlan = false;
  uint32_t widthHistory[WIDTH_HISTORY_SIZE] = {};
  size_t widthCount = 0;
  size_t widthIndex = 0;
  bool roundStarted = false;
  uint64_t roundStartMs = 0;
  uint32_t baseFrame = 0;
  uint32_t speedFrame = 0;
  float baseGameSpeed = GAME_START_SPEED;
  float gameSpeed = GAME_START_SPEED;
  float speedScale = 1.0f;
  uint32_t travelMs = 0;
  uint32_t gapMs = 0;
  uint32_t plannedJumps = 0;
};

struct LogMessage { char text[192]; };

struct UIntSetting {
  const char *name;
  const char *legacy;
  uint32_t Config::*field;
  uint32_t minValue;
  uint32_t maxValue;
};

constexpr UIntSetting UINT_SETTINGS[] = {
    {"hold", "holdms", &Config::holdMs, 1, 2000},
    {"longhold", "longholdms", &Config::longHoldMs, 1, 2000},
    {"air", "airms", &Config::airMs, 1, 3000},
    {"longair", "longairms", &Config::longAirMs, 1, 3000},
    {"actuator", "actuatorms", &Config::actuatorMs, 0, 5000},
    {"travel", "travelms", &Config::travelMs, 1, 10000},
    {"mintravel", "mintravelms", &Config::minTravelMs, 1, 10000},
    {"landing", "landingms", &Config::landingMs, 0, 2000},
    {"clearance", "clearancems", &Config::clearanceMs, 0, 3000},
    {"gap", "gapms", &Config::gapMs, 1, 1000},
    {"cooldown", "cooldownms", &Config::cooldownMs, 0, 3000},
    {"rearm", "rearmms", &Config::rearmMs, 0, 3000},
    {"sample", "samplems", &Config::sampleMs, 2, 50},
    {"themeflip", "themeflipms", &Config::themeFlipMs, 100, 10000},
};

Servo servo;
Preferences prefs;
Config config;
Detector detector;

float sensorRatio = DEFAULT_SENSOR_RATIO;
uint32_t gameFps = DEFAULT_GAME_FPS;
uint32_t firstCactusDelayMs = DEFAULT_FIRST_CACTUS_DELAY_MS;

QueueHandle_t clickQueue = nullptr;
QueueHandle_t logQueue = nullptr;
SemaphoreHandle_t stateMutex = nullptr;
TaskHandle_t sensorTaskHandle = nullptr;
TaskHandle_t servoTaskHandle = nullptr;
TaskHandle_t serialTaskHandle = nullptr;

volatile bool playing = false;
volatile uint32_t playGeneration = 1;

bool prefsReady = false;
bool backgroundIsWhite = true;
bool filteredWhite = true;
int lastSensorValue = 0;
String serialLine;

uint64_t nowMs() {
  return static_cast<uint64_t>(esp_timer_get_time()) / 1000ULL;
}

const char *onOff(bool value) { return value ? "on" : "off"; }
const char *colorName(bool white) { return white ? "white" : "black"; }

const char *themeName(ThemeMode mode) {
  if (mode == ThemeMode::Light) return "light";
  if (mode == ThemeMode::Dark) return "dark";
  return "auto";
}

Config getConfig() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  Config copy = config;
  xSemaphoreGive(stateMutex);
  return copy;
}

String normalize(String text) {
  text.trim();
  text.toLowerCase();
  text.replace("_", "");
  text.replace("-", "");
  return text;
}

bool parseLong(const String &text, long &value) {
  char *end = nullptr;
  value = strtol(text.c_str(), &end, 10);
  while (end && *end == ' ') ++end;
  return end && end != text.c_str() && *end == '\0';
}

bool parseFloatValue(const String &text, float &value) {
  char *end = nullptr;
  value = strtof(text.c_str(), &end);
  while (end && *end == ' ') ++end;
  return end && end != text.c_str() && *end == '\0';
}

bool parseBool(String text, bool &value) {
  text = normalize(text);
  if (text == "on" || text == "true" || text == "1" || text == "yes") {
    value = true;
    return true;
  }
  if (text == "off" || text == "false" || text == "0" || text == "no") {
    value = false;
    return true;
  }
  return false;
}

