Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
void queueLog(const char *format, ...) {
  if (!logQueue) return;
  LogMessage message{};
  va_list args;
  va_start(args, format);
  vsnprintf(message.text, sizeof(message.text), format, args);
  va_end(args);
  xQueueSend(logQueue, &message, 0);
}

bool configValid(const Config &c) {
  return c.magic == CONFIG_MAGIC &&
         c.version == CONFIG_VERSION &&
         c.threshold >= 0 && c.threshold <= 4095 &&
         c.restAngle >= 0 && c.restAngle <= 180 &&
         c.pressAngle >= 0 && c.pressAngle <= 180 &&
         c.holdMs >= 1 && c.holdMs <= 2000 &&
         c.longHoldMs >= 1 && c.longHoldMs <= 2000 &&
         c.airMs >= 1 && c.airMs <= 3000 &&
         c.longAirMs >= 1 && c.longAirMs <= 3000 &&
         c.longAtWidths >= 1.1f && c.longAtWidths <= 4.0f &&
         c.actuatorMs <= 5000 &&
         c.travelMs >= 1 && c.travelMs <= 10000 &&
         c.minTravelMs >= 1 && c.minTravelMs <= 10000 &&
         c.landingMs <= 2000 &&
         c.clearanceMs <= 3000 &&
         c.gapMs >= 1 && c.gapMs <= 1000 &&
         c.cooldownMs <= 3000 &&
         c.rearmMs <= 3000 &&
         c.themeFlipMs >= 100 && c.themeFlipMs <= 10000 &&
         c.sampleMs >= 2 && c.sampleMs <= 50 &&
         c.adaptStepPct > 0 && c.adaptStepPct <= 20 &&
         static_cast<uint8_t>(c.theme) <= 2;
}

bool legacyValid(const LegacyConfig &c) {
  return c.magic == CONFIG_MAGIC &&
         (c.version == 1 || c.version == 2) &&
         c.threshold >= 0 && c.threshold <= 4095 &&
         c.restAngle >= 0 && c.restAngle <= 180 &&
         c.pressAngle >= 0 && c.pressAngle <= 180 &&
         c.holdMs >= 1 && c.holdMs <= 2000 &&
         c.airMs >= 1 && c.airMs <= 3000 &&
         c.travelMs >= 1 && c.travelMs <= 10000 &&
         c.sampleMs >= 1 && c.sampleMs <= 1000;
}

void migrateLegacy(const LegacyConfig &old) {
  config = Config{};
  config.threshold = old.threshold;
  config.restAngle = old.restAngle;
  config.pressAngle = old.pressAngle;
  config.holdMs = old.holdMs;
  config.airMs = old.airMs;
  config.actuatorMs = old.actuatorMs;
  config.travelMs = old.travelMs;
  config.minTravelMs = old.minTravelMs;
  config.landingMs = old.landingMs;
  config.clearanceMs = old.clearanceMs;
  config.gapMs = old.gapMs;
  config.cooldownMs = old.cooldownMs;
  config.rearmMs = old.rearmMs;
  config.themeFlipMs = old.themeFlipMs;
  config.sampleMs = old.sampleMs;
  config.adapt = old.adapt;
  config.adaptStepPct = old.adaptStepPct;
  config.theme = old.theme;
  config.debug = old.debug;

  if (old.version == 1) {
    if (config.sampleMs == 2) config.sampleMs = 5;
    if (config.gapMs == 120) config.gapMs = 40;
    if (config.landingMs == 30) config.landingMs = 50;
    if (config.clearanceMs == 90) config.clearanceMs = 100;
    if (config.adaptStepPct == 6.0f) config.adaptStepPct = 3.0f;
  }
}

bool saveConfig(bool announce = true) {
  if (!prefsReady) return false;
  Config copy = getConfig();
  bool ok = prefs.putBytes("config", &copy, sizeof(copy)) == sizeof(copy);
  if (announce) {
    Serial.println(ok ? "[SAVE] Saved to flash."
                      : "[SAVE] Flash write failed.");
  }
  return ok;
}

void loadConfig() {
  prefsReady = prefs.begin("dino", false);
  if (!prefsReady) {
    Serial.println("[NVS] Flash unavailable; using defaults.");
    return;
  }

  size_t bytes = prefs.getBytesLength("config");
  bool migrated = false;

  if (bytes == sizeof(Config)) {
    prefs.getBytes("config", &config, sizeof(config));
  } else if (bytes == sizeof(LegacyConfig)) {
    LegacyConfig old{};
    prefs.getBytes("config", &old, sizeof(old));
    if (legacyValid(old)) {
      migrateLegacy(old);
      migrated = true;
    }
  }

  if (!configValid(config)) {
    config = Config{};
    Serial.println("[NVS] Defaults loaded.");
  } else if (migrated) {
    Serial.println("[NVS] Existing calibration migrated.");
  } else {
    Serial.println("[NVS] Saved configuration loaded.");
  }

  prefs.putBytes("config", &config, sizeof(config));

  sensorRatio = prefs.getFloat("ratio", DEFAULT_SENSOR_RATIO);
  if (sensorRatio < 0.5f || sensorRatio > 6.0f)
    sensorRatio = DEFAULT_SENSOR_RATIO;

  gameFps = prefs.getUInt("gamefps", DEFAULT_GAME_FPS);
  if (gameFps < MIN_GAME_FPS || gameFps > MAX_GAME_FPS)
    gameFps = DEFAULT_GAME_FPS;

  firstCactusDelayMs =
      prefs.getUInt("firstdelay", DEFAULT_FIRST_CACTUS_DELAY_MS);
  if (firstCactusDelayMs > MAX_FIRST_CACTUS_DELAY_MS)
    firstCactusDelayMs = DEFAULT_FIRST_CACTUS_DELAY_MS;
}

int readSensor() { return analogRead(SENSOR_PIN); }

int median3(int a, int b, int c) {
  if (a > b) { int t = a; a = b; b = t; }
  if (b > c) { int t = b; b = c; c = t; }
  if (a > b) b = a;
  return b;
}

bool classifyWhite(int adc, int threshold, bool previous) {
  return previous ? adc > threshold - SENSOR_HYSTERESIS
                  : adc > threshold + SENSOR_HYSTERESIS;
}

void resetEnvelopeLocked() {
  detector.active = false;
  detector.startMs = 0;
  detector.lastObstacleMs = 0;
  detector.oppositeSinceMs = 0;
}

uint32_t estimatedBaseFrameLocked() {
  uint64_t base =
      static_cast<uint64_t>(firstCactusDelayMs) * gameFps / 1000ULL;
  if (base > GAME_MAX_ACCEL_FRAMES) base = GAME_MAX_ACCEL_FRAMES;
  return static_cast<uint32_t>(base);
}

float speedForFrame(uint32_t frame) {
  float speed = GAME_START_SPEED + GAME_ACCEL_PER_FRAME * frame;
  return speed > GAME_MAX_SPEED ? GAME_MAX_SPEED : speed;
}

void resetRoundLocked() {
  detector = Detector{};
  detector.travelMs = config.travelMs;
  detector.gapMs = config.gapMs;
  detector.baseFrame = estimatedBaseFrameLocked();
  detector.baseGameSpeed = speedForFrame(detector.baseFrame);
  detector.gameSpeed = detector.baseGameSpeed;
}

void updateRoundTimingLocked(uint64_t now) {
  detector.baseFrame = estimatedBaseFrameLocked();
  detector.baseGameSpeed = speedForFrame(detector.baseFrame);

  uint32_t absoluteFrame = detector.baseFrame;
  float speed = detector.baseGameSpeed;
  float scale = 1.0f;

  if (config.adapt && detector.roundStarted && now > detector.roundStartMs) {
    uint64_t elapsedMs = now - detector.roundStartMs;
    uint64_t roundFrames = elapsedMs * gameFps / 1000ULL;
    uint64_t absoluteFrames =
        static_cast<uint64_t>(detector.baseFrame) + roundFrames;

    if (absoluteFrames > GAME_MAX_ACCEL_FRAMES)
      absoluteFrames = GAME_MAX_ACCEL_FRAMES;

    absoluteFrame = static_cast<uint32_t>(absoluteFrames);
    speed = speedForFrame(absoluteFrame);

    if (detector.baseGameSpeed > 0.0f)
      scale = speed / detector.baseGameSpeed;
  }

