Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
  detector.speedFrame = absoluteFrame;
  detector.gameSpeed = speed;
  detector.speedScale = scale;

  uint32_t travel =
      static_cast<uint32_t>(config.travelMs / scale + 0.5f);
  if (travel < config.minTravelMs) travel = config.minTravelMs;
  detector.travelMs = travel;

  uint32_t gap =
      static_cast<uint32_t>(config.gapMs / scale + 0.5f);
  uint32_t minGap = config.sampleMs * 3;
  detector.gapMs = gap > minGap ? gap : minGap;
}

void startRoundLocked(uint64_t firstCactusExitMs) {
  if (detector.roundStarted) return;
  detector.roundStarted = true;
  detector.roundStartMs = firstCactusExitMs;
  updateRoundTimingLocked(firstCactusExitMs);
}

uint32_t roundElapsedMsLocked(uint64_t now) {
  if (!detector.roundStarted || now <= detector.roundStartMs) return 0;
  uint64_t elapsed = now - detector.roundStartMs;
  return elapsed > UINT32_MAX
      ? UINT32_MAX
      : static_cast<uint32_t>(elapsed);
}

void pushWidthPulseLocked(uint32_t pulseMs) {
  detector.widthHistory[detector.widthIndex] = pulseMs;
  detector.widthIndex =
      (detector.widthIndex + 1) % WIDTH_HISTORY_SIZE;
  if (detector.widthCount < WIDTH_HISTORY_SIZE)
    ++detector.widthCount;
}

uint32_t widthReferenceLocked() {
  if (!detector.widthCount) return 0;

  uint32_t values[WIDTH_HISTORY_SIZE];
  for (size_t i = 0; i < detector.widthCount; ++i)
    values[i] = detector.widthHistory[i];

  for (size_t i = 1; i < detector.widthCount; ++i) {
    uint32_t value = values[i];
    size_t j = i;
    while (j && values[j - 1] > value) {
      values[j] = values[j - 1];
      --j;
    }
    values[j] = value;
  }

  size_t index =
      detector.widthCount >= 3 ? 2 : detector.widthCount - 1;
  return values[index];
}

float estimateWidthLocked(uint32_t pulseMs, uint32_t referenceMs) {
  if (!referenceMs || detector.widthCount < CLASSIFY_WARMUP)
    return 1.0f;

  float cactusMs = referenceMs / (sensorRatio + 1.0f);
  float sensorMs = referenceMs - cactusMs;
  if (cactusMs < 1.0f) return 1.0f;

  float widths = (pulseMs - sensorMs) / cactusMs;
  return widths < 0.5f ? 0.5f : widths;
}

void clearClickQueue() {
  ClickCommand ignored{};
  while (clickQueue &&
         xQueueReceive(clickQueue, &ignored, 0) == pdTRUE) {}
}

bool queueClick(uint64_t atMs, bool manual,
                uint32_t holdMs, const Config &cfg) {
  ClickCommand cmd{
      atMs, playGeneration, cfg.pressAngle, cfg.restAngle,
      holdMs, manual, cfg.debug};

  if (xQueueSend(clickQueue, &cmd, 0) == pdTRUE) return true;
  queueLog("[WARN] Servo queue full; click dropped.");
  return false;
}

bool queueClick(uint64_t atMs, bool manual, bool longJump = false) {
  Config cfg = getConfig();
  return queueClick(
      atMs, manual, longJump ? cfg.longHoldMs : cfg.holdMs, cfg);
}

void insertPending(ClickCommand *pending, size_t &count,
                   const ClickCommand &cmd) {
  if (count >= CLICK_QUEUE_SIZE) return;
  size_t i = count;
  while (i && pending[i - 1].atMs > cmd.atMs) {
    pending[i] = pending[i - 1];
    --i;
  }
  pending[i] = cmd;
  ++count;
}

void prunePending(ClickCommand *pending, size_t &count) {
  size_t out = 0;
  for (size_t i = 0; i < count; ++i) {
    if (pending[i].manual ||
        (playing && pending[i].generation == playGeneration))
      pending[out++] = pending[i];
  }
  count = out;
}

void servoTask(void *) {
  ClickCommand pending[CLICK_QUEUE_SIZE]{};
  size_t count = 0;

  for (;;) {
    prunePending(pending, count);

    TickType_t wait = portMAX_DELAY;
    if (count) {
      uint64_t now = nowMs();
      uint64_t remaining =
          pending[0].atMs > now ? pending[0].atMs - now : 0;
      wait = remaining
          ? pdMS_TO_TICKS(static_cast<uint32_t>(remaining))
          : 0;
    }

    ClickCommand incoming{};
    if (xQueueReceive(clickQueue, &incoming, wait) == pdTRUE) {
      insertPending(pending, count, incoming);
      continue;
    }
    if (!count) continue;

    ClickCommand cmd = pending[0];
    for (size_t i = 1; i < count; ++i)
      pending[i - 1] = pending[i];
    --count;

    if (!cmd.manual &&
        (!playing || cmd.generation != playGeneration))
      continue;

    uint64_t actual = nowMs();
    servo.write(cmd.pressAngle);

    TickType_t hold = pdMS_TO_TICKS(cmd.holdMs);
    vTaskDelay(hold ? hold : 1);

    servo.write(cmd.restAngle);

    if (cmd.debug) {
      uint64_t late = actual > cmd.atMs ? actual - cmd.atMs : 0;
      queueLog("[CLICK] hold=%lu task-late=%llu ms",
               static_cast<unsigned long>(cmd.holdMs),
               static_cast<unsigned long long>(late));
    }
  }
}

void finalizeEnvelopeLocked(uint64_t now) {
  if (!detector.active ||
      detector.lastObstacleMs < detector.startMs) {
    resetEnvelopeLocked();
    return;
  }

  uint32_t pulseMs =
      static_cast<uint32_t>(
          detector.lastObstacleMs - detector.startMs);
  if (!pulseMs) pulseMs = 1;

  startRoundLocked(detector.lastObstacleMs);
  updateRoundTimingLocked(now);

  pushWidthPulseLocked(pulseMs);
  uint32_t referenceMs = widthReferenceLocked();

  float widthEstimate =
      estimateWidthLocked(pulseMs, referenceMs);
  bool longJump =
      detector.widthCount < CLASSIFY_WARMUP ||
      widthEstimate >= config.longAtWidths;

  float sensorFootprintMs = referenceMs
      ? referenceMs * sensorRatio / (sensorRatio + 1.0f)
      : pulseMs * sensorRatio / (sensorRatio + 1.0f);

  int64_t edgeCorrection =
      static_cast<int64_t>(sensorFootprintMs * 0.5f);

  uint32_t holdMs =
      longJump ? config.longHoldMs : config.holdMs;
  uint32_t airMs =
      longJump ? config.longAirMs : config.airMs;

  int64_t entry =
      static_cast<int64_t>(detector.startMs) +
      edgeCorrection + detector.travelMs;
  int64_t exit =
      static_cast<int64_t>(detector.lastObstacleMs) -
      edgeCorrection + detector.travelMs;
  if (exit < entry) exit = entry;

  int64_t exitContact =
      exit + config.landingMs - airMs;
  int64_t safeContact =
      entry - config.clearanceMs;
  int64_t commandAt =
      (exitContact < safeContact ? exitContact : safeContact) -
      config.actuatorMs;

