Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
  bool entrySafety = safeContact < exitContact;
  bool delayedLanding = false;
  bool delayedCooldown = false;

  if (detector.hasPlan) {
    int64_t afterLanding =
        static_cast<int64_t>(detector.lastLandingMs) +
        config.rearmMs - config.actuatorMs;
    int64_t afterCooldown =
        static_cast<int64_t>(detector.lastCommandMs) +
        config.cooldownMs;

    if (commandAt < afterLanding) {
      commandAt = afterLanding;
      delayedLanding = true;
    }
    if (commandAt < afterCooldown) {
      commandAt = afterCooldown;
      delayedCooldown = true;
    }
  }

  uint64_t lateMs = 0;
  if (commandAt < static_cast<int64_t>(now)) {
    lateMs = static_cast<uint64_t>(
        static_cast<int64_t>(now) - commandAt);
    commandAt = static_cast<int64_t>(now);
  }

  const char *reason =
      lateMs ? "sensor-too-close" :
      delayedLanding ? "post-landing-rejump" :
      delayedCooldown ? "cooldown" :
      entrySafety ? "entry-safety" :
      "exit-aligned";

  uint64_t executeAt =
      static_cast<uint64_t>(commandAt);

  if (queueClick(executeAt, false, holdMs, config)) {
    ++detector.plannedJumps;
    detector.lastCommandMs = executeAt;
    detector.lastLandingMs =
        executeAt + config.actuatorMs + airMs;
    detector.hasPlan = true;

    uint32_t roundMs = roundElapsedMsLocked(now);
    queueLog(
        "[PLAN] #%lu %s width=%.2f round=%.1fs frame=%lu "
        "game=%.3f scale=x%.3f travel=%lu gap=%lu hold=%lu "
        "cmd-in=%lld late=%llu %s",
        static_cast<unsigned long>(detector.plannedJumps),
        longJump ? "LONG" : "SHORT",
        widthEstimate,
        roundMs / 1000.0f,
        static_cast<unsigned long>(detector.speedFrame),
        detector.gameSpeed,
        detector.speedScale,
        static_cast<unsigned long>(detector.travelMs),
        static_cast<unsigned long>(detector.gapMs),
        static_cast<unsigned long>(holdMs),
        static_cast<long long>(
            static_cast<int64_t>(executeAt) -
            static_cast<int64_t>(now)),
        static_cast<unsigned long long>(lateMs),
        reason);
  }

  resetEnvelopeLocked();
}

void sensorTask(void *) {
  TickType_t wake = xTaskGetTickCount();

  int first = readSensor();
  int samples[3] = {first, first, first};
  size_t sampleIndex = 0;
  filteredWhite = first > config.threshold;

  for (;;) {
    Config cfg = getConfig();
    vTaskDelayUntil(&wake, pdMS_TO_TICKS(cfg.sampleMs));

    samples[sampleIndex] = readSensor();
    sampleIndex = (sampleIndex + 1) % 3;
    int adc = median3(samples[0], samples[1], samples[2]);

    uint64_t now = nowMs();
    bool themeChanged = false;
    bool newBackground = false;

    xSemaphoreTake(stateMutex, portMAX_DELAY);

    lastSensorValue = adc;
    filteredWhite =
        classifyWhite(adc, config.threshold, filteredWhite);

    updateRoundTimingLocked(now);

    if (playing) {
      bool obstacle =
          filteredWhite != backgroundIsWhite;

      if (config.theme == ThemeMode::Auto) {
        if (obstacle) {
          if (!detector.oppositeSinceMs)
            detector.oppositeSinceMs = now;

          if (now - detector.oppositeSinceMs >=
              config.themeFlipMs) {
            backgroundIsWhite = filteredWhite;
            newBackground = backgroundIsWhite;
            resetEnvelopeLocked();
            obstacle = false;
            themeChanged = true;
          }
        } else {
          detector.oppositeSinceMs = 0;
        }
      }

      if (obstacle) {
        if (!detector.active) {
          detector.active = true;
          detector.startMs = now;
        }
        detector.lastObstacleMs = now;
      } else if (
          detector.active &&
          now - detector.lastObstacleMs >= detector.gapMs) {
        finalizeEnvelopeLocked(now);
      }
    }

    xSemaphoreGive(stateMutex);

    if (themeChanged)
      queueLog("[THEME] Background rebased to %s.",
               colorName(newBackground));
  }
}

void chooseBackground() {
  int adc = readSensor();

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  lastSensorValue = adc;
  filteredWhite = adc > config.threshold;
  backgroundIsWhite =
      config.theme == ThemeMode::Light ? true :
      config.theme == ThemeMode::Dark ? false :
      filteredWhite;
  xSemaphoreGive(stateMutex);
}

void printManual() {
  Serial.println(
      "\nstart | arm | stop | click | longclick | show | sensor | reset | defaults");
  Serial.println("theme auto|light|dark");
  Serial.println("<name> <value>  (auto-saved)");
  Serial.println(
      "threshold rest press hold longhold air longair longat");
  Serial.println(
      "actuator travel mintravel landing clearance gap sample cooldown rearm");
  Serial.println("ratio gamefps firstdelay adapt debug");
  Serial.println(
      "firstdelay=ms before first cactus (Chrome/ChromeDino default ~3000)\n");
}

void printStatus() {
  Config cfg = getConfig();
  int adc = readSensor();
  uint64_t now = nowMs();

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  float ratio = sensorRatio;
  uint32_t fps = gameFps;
  uint32_t delayMs = firstCactusDelayMs;
  uint32_t baseFrame = detector.baseFrame;
  uint32_t speedFrame = detector.speedFrame;
  float baseSpeed = detector.baseGameSpeed;
  float gameSpeed = detector.gameSpeed;
  float scale = detector.speedScale;
  uint32_t effectiveTravel = detector.travelMs;
  uint32_t effectiveGap = detector.gapMs;
  bool bg = backgroundIsWhite;
  bool roundStarted = detector.roundStarted;
  uint32_t roundMs = roundElapsedMsLocked(now);
  uint32_t ref = widthReferenceLocked();
  xSemaphoreGive(stateMutex);

  Serial.println("\n=== Dino Auto-Player ===");
  Serial.printf(
      "Run=%s | round=%s",
      playing ? "ON" : "OFF",
      roundStarted ? "RUNNING" : "WAITING FOR FIRST CACTUS");
  if (roundStarted)
    Serial.printf(" (%.1f s)", roundMs / 1000.0f);
  Serial.println();

  Serial.printf(
      "Sensor=%d (%s) | threshold=%d | background=%s | theme=%s\n",
      adc, colorName(adc > cfg.threshold),
      cfg.threshold, colorName(bg), themeName(cfg.theme));

  Serial.printf(
      "Servo: rest=%d press=%d | SHORT hold=%lu air=%lu | LONG hold=%lu air=%lu\n",
      cfg.restAngle, cfg.pressAngle,
      static_cast<unsigned long>(cfg.holdMs),
      static_cast<unsigned long>(cfg.airMs),
      static_cast<unsigned long>(cfg.longHoldMs),
      static_cast<unsigned long>(cfg.longAirMs));

  Serial.printf(
      "Long jump: width >= %.2f cactus-widths | pulse reference=%lu ms\n",
      cfg.longAtWidths,
      static_cast<unsigned long>(ref));

  Serial.printf(
      "Acceleration: base frame=%lu speed=%.3f | frame=%lu speed=%.3f scale=x%.3f\n",
      static_cast<unsigned long>(baseFrame), baseSpeed,
      static_cast<unsigned long>(speedFrame), gameSpeed, scale);

  Serial.printf(
      "Game model: +0.001/frame @%luHz | firstdelay=%lums | timed=%s\n",
      static_cast<unsigned long>(fps),
      static_cast<unsigned long>(delayMs),
      onOff(cfg.adapt));

  Serial.printf(
      "Timing: travel=%lu->%lu gap=%lu->%lu actuator=%lu landing=%lu clearance=%lu\n",
      static_cast<unsigned long>(cfg.travelMs),
      static_cast<unsigned long>(effectiveTravel),
      static_cast<unsigned long>(cfg.gapMs),
      static_cast<unsigned long>(effectiveGap),
      static_cast<unsigned long>(cfg.actuatorMs),
      static_cast<unsigned long>(cfg.landingMs),
      static_cast<unsigned long>(cfg.clearanceMs));

  Serial.printf(
      "Sensor: sample=%lu ratio=%.2f:1 hysteresis=%d | debug=%s | flash=%s\n",
      static_cast<unsigned long>(cfg.sampleMs),
      ratio, SENSOR_HYSTERESIS,
      onOff(cfg.debug),
      prefsReady ? "ready" : "unavailable");
}

void armFreshRound(bool clickToStart) {
  chooseBackground();
  uint64_t now = nowMs();

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  ++playGeneration;
  resetRoundLocked();
  playing = true;
  bool bg = backgroundIsWhite;
  int adc = lastSensorValue;
  xSemaphoreGive(stateMutex);

  clearClickQueue();

  Serial.printf(
      "[ARM] Ready. Next cactus is timing baseline. "
      "Background=%s sensor=%d.\n",
      colorName(bg), adc);

  if (clickToStart && queueClick(now, true, false))
    Serial.println("[START] Initial short click queued.");
}

void stopAutoplay() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  playing = false;
  ++playGeneration;
  resetEnvelopeLocked();
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);

  clearClickQueue();
  servo.write(rest);
  Serial.println("[STOP] Autoplay stopped.");
}

