Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
enum class SetResult { Changed, Invalid, Unknown };

SetResult setParameter(String rawName, String value) {
  String name = normalize(rawName);
  long number = 0;

  if (name == "gamefps" || name == "fps") {
    if (!parseLong(value, number) ||
        number < static_cast<long>(MIN_GAME_FPS) ||
        number > static_cast<long>(MAX_GAME_FPS))
      return SetResult::Invalid;

    xSemaphoreTake(stateMutex, portMAX_DELAY);
    gameFps = static_cast<uint32_t>(number);
    resetRoundLocked();
    xSemaphoreGive(stateMutex);

    if (prefsReady) prefs.putUInt("gamefps", gameFps);
    Serial.printf("[SET] gamefps = %lu\n",
                  static_cast<unsigned long>(gameFps));
    return SetResult::Changed;
  }

  if (name == "firstdelay" ||
      name == "cleartime" ||
      name == "firstcactusdelay") {
    if (!parseLong(value, number) ||
        number < 0 ||
        static_cast<uint32_t>(number) >
            MAX_FIRST_CACTUS_DELAY_MS)
      return SetResult::Invalid;

    xSemaphoreTake(stateMutex, portMAX_DELAY);
    firstCactusDelayMs = static_cast<uint32_t>(number);
    resetRoundLocked();
    xSemaphoreGive(stateMutex);

    if (prefsReady)
      prefs.putUInt("firstdelay", firstCactusDelayMs);

    Serial.printf("[SET] firstdelay = %lu ms\n",
                  static_cast<unsigned long>(firstCactusDelayMs));
    return SetResult::Changed;
  }

  if (name == "ratio") {
    float ratio;
    if (!parseFloatValue(value, ratio) ||
        ratio < 0.5f || ratio > 6.0f)
      return SetResult::Invalid;

    xSemaphoreTake(stateMutex, portMAX_DELAY);
    sensorRatio = ratio;
    xSemaphoreGive(stateMutex);

    if (prefsReady) prefs.putFloat("ratio", ratio);
    Serial.printf("[SET] ratio = %.2f\n", ratio);
    return SetResult::Changed;
  }

  bool changed = false;
  bool resetRound = false;
  bool refreshBackground = false;
  bool moveRest = false;

  xSemaphoreTake(stateMutex, portMAX_DELAY);

  if (name == "threshold" ||
      name == "rest" ||
      name == "press" ||
      name == "clickangle") {
    if (!parseLong(value, number)) {
      xSemaphoreGive(stateMutex);
      return SetResult::Invalid;
    }

    if (name == "threshold" &&
        number >= 0 && number <= 4095)
      config.threshold = static_cast<int>(number);
    else if (name == "rest" &&
             number >= 0 && number <= 180)
      config.restAngle = static_cast<int>(number);
    else if ((name == "press" || name == "clickangle") &&
             number >= 0 && number <= 180)
      config.pressAngle = static_cast<int>(number);
    else {
      xSemaphoreGive(stateMutex);
      return SetResult::Invalid;
    }

    changed = true;
    refreshBackground = name == "threshold";
    moveRest = name == "rest" && !playing;

  } else if (
      name == "adapt" ||
      name == "debug" ||
      name == "autotheme") {
    bool flag;
    if (!parseBool(value, flag)) {
      xSemaphoreGive(stateMutex);
      return SetResult::Invalid;
    }

    if (name == "adapt") {
      config.adapt = flag;
      resetRound = true;
    } else if (name == "debug") {
      config.debug = flag;
    } else {
      config.theme =
          flag ? ThemeMode::Auto :
          (backgroundIsWhite
              ? ThemeMode::Light
              : ThemeMode::Dark);
      refreshBackground = true;
    }
    changed = true;

  } else if (name == "longat") {
    float width;
    if (!parseFloatValue(value, width) ||
        width < 1.1f || width > 4.0f) {
      xSemaphoreGive(stateMutex);
      return SetResult::Invalid;
    }
    config.longAtWidths = width;
    changed = true;

  } else if (name == "adaptstep") {
    float valueFloat;
    if (!parseFloatValue(value, valueFloat) ||
        valueFloat <= 0 || valueFloat > 20) {
      xSemaphoreGive(stateMutex);
      return SetResult::Invalid;
    }
    config.adaptStepPct = valueFloat;
    changed = true;

  } else {
    for (const auto &setting : UINT_SETTINGS) {
      if (name != setting.name && name != setting.legacy)
        continue;

      if (!parseLong(value, number) ||
          number < 0 ||
          static_cast<uint32_t>(number) < setting.minValue ||
          static_cast<uint32_t>(number) > setting.maxValue) {
        xSemaphoreGive(stateMutex);
        return SetResult::Invalid;
      }

      config.*(setting.field) =
          static_cast<uint32_t>(number);
      changed = true;

      resetRound =
          name == "travel" ||
          name == "travelms" ||
          name == "mintravel" ||
          name == "mintravelms" ||
          name == "gap" ||
          name == "gapms";
      break;
    }
  }

  if (resetRound) resetRoundLocked();
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);

  if (!changed) return SetResult::Unknown;

  if (moveRest) servo.write(rest);
  if (refreshBackground) chooseBackground();

  saveConfig();
  Serial.printf("[SET] %s = %s\n",
                rawName.c_str(), value.c_str());
  return SetResult::Changed;
}

bool setTheme(String value) {
  value = normalize(value);

  ThemeMode mode;
  if (value == "auto") mode = ThemeMode::Auto;
  else if (value == "light") mode = ThemeMode::Light;
  else if (value == "dark") mode = ThemeMode::Dark;
  else return false;

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  config.theme = mode;
  resetEnvelopeLocked();
  xSemaphoreGive(stateMutex);

  chooseBackground();
  saveConfig();
  Serial.printf("[THEME] %s.\n", themeName(mode));
  return true;
}

void restoreDefaults() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  config = Config{};
  sensorRatio = DEFAULT_SENSOR_RATIO;
  gameFps = DEFAULT_GAME_FPS;
  firstCactusDelayMs = DEFAULT_FIRST_CACTUS_DELAY_MS;
  resetRoundLocked();
  bool moveRest = !playing;
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);

  if (moveRest) servo.write(rest);
  chooseBackground();
  saveConfig();

  if (prefsReady) {
    prefs.putFloat("ratio", DEFAULT_SENSOR_RATIO);
    prefs.putUInt("gamefps", DEFAULT_GAME_FPS);
    prefs.putUInt("firstdelay", DEFAULT_FIRST_CACTUS_DELAY_MS);
  }

