Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
  Serial.println("[DEFAULTS] Defaults restored and saved.");
}

void handleCommand(String line) {
  line.trim();
  line.toLowerCase();
  if (!line.length()) return;

  if (line.startsWith("set ")) {
    line.remove(0, 4);
    line.trim();
  }

  int split = line.indexOf(' ');
  String command =
      split < 0 ? line : line.substring(0, split);
  String value =
      split < 0 ? "" : line.substring(split + 1);
  value.trim();

  if (command == "help" ||
      command == "manual" ||
      command == "?") {
  } else if (command == "start" ||
             command == "run") {
    armFreshRound(true);
  } else if (command == "arm") {
    armFreshRound(false);
  } else if (command == "stop" ||
             command == "pause") {
    stopAutoplay();
  } else if (command == "click" ||
             command == "jump") {
    if (queueClick(nowMs(), true, false))
      Serial.println("[MANUAL] Short click queued.");
  } else if (command == "longclick" ||
             command == "longjump") {
    if (queueClick(nowMs(), true, true))
      Serial.println("[MANUAL] Long click queued.");
  } else if (command == "show" ||
             command == "status") {
    printStatus();
  } else if (command == "sensor") {
    Config cfg = getConfig();
    int adc = readSensor();
    Serial.printf(
        "[SENSOR] ADC=%d -> %s (threshold=%d)\n",
        adc, colorName(adc > cfg.threshold), cfg.threshold);
  } else if (command == "reset") {
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    ++playGeneration;
    resetRoundLocked();
    playing = true;
    xSemaphoreGive(stateMutex);
    clearClickQueue();

    Serial.println(
        "[RESET] Round reset. Autoplay stays armed; "
        "next cactus becomes the calibrated baseline.");
  } else if (command == "defaults") {
    restoreDefaults();
  } else if (command == "theme") {
    if (!setTheme(value))
      Serial.println(
          "[ERR] Use: theme auto | theme light | theme dark");
  } else if (value.length()) {
    SetResult result = setParameter(command, value);
    if (result == SetResult::Invalid)
      Serial.println("[ERR] Invalid value.");
    else if (result == SetResult::Unknown)
      Serial.println("[ERR] Unknown setting.");
  } else {
    Serial.println("[ERR] Unknown command.");
  }
}

void serialTask(void *) {
  for (;;) {
    LogMessage message{};
    while (xQueueReceive(logQueue, &message, 0) == pdTRUE)
      Serial.println(message.text);

    while (Serial.available()) {
      char c = static_cast<char>(Serial.read());

      if (c == '\n' || c == '\r') {
        if (serialLine.length()) {
          handleCommand(serialLine);
          serialLine = "";
          printManual();
        }
      } else if (serialLine.length() < 120) {
        serialLine += c;
      }
    }

    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

void fatal(const char *message) {
  Serial.println(message);
  for (;;)
    vTaskDelay(pdMS_TO_TICKS(1000));
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(200);

  pinMode(SENSOR_PIN, INPUT);
  analogReadResolution(12);

  stateMutex = xSemaphoreCreateMutex();
  if (!stateMutex)
    fatal("[FATAL] Could not create state mutex.");

  loadConfig();

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  resetRoundLocked();
  playing = true;
  ++playGeneration;
  xSemaphoreGive(stateMutex);

  servo.setPeriodHertz(50);
  servo.attach(SERVO_PIN, 500, 2400);
  servo.write(config.restAngle);

  clickQueue =
      xQueueCreate(CLICK_QUEUE_SIZE, sizeof(ClickCommand));
  logQueue =
      xQueueCreate(LOG_QUEUE_SIZE, sizeof(LogMessage));

  if (!clickQueue || !logQueue)
    fatal("[FATAL] Could not create runtime queues.");

  chooseBackground();

  if (xTaskCreatePinnedToCore(
          servoTask, "dino-servo", 4096, nullptr, 5,
          &servoTaskHandle, 1) != pdPASS ||
      xTaskCreatePinnedToCore(
          sensorTask, "dino-sensor", 4096, nullptr, 4,
          &sensorTaskHandle, 0) != pdPASS ||
      xTaskCreatePinnedToCore(
          serialTask, "dino-serial", 4096, nullptr, 2,
          &serialTaskHandle, 0) != pdPASS) {
    fatal("[FATAL] Could not create FreeRTOS tasks.");
  }

  Serial.println(
      "\nDino ESP32 Auto-Player ready "
      "(auto-armed + first-cactus calibrated acceleration).");
  Serial.println(
      "[AUTO] Waiting for first cactus. "
      "Its timing becomes scale x1.000.");
  Serial.println(
      "Runtime: sensor task + servo task + serial task. "
      "loop() stays idle.");

  printStatus();
  printManual();
}

void loop() {
  vTaskDelay(portMAX_DELAY);
}
